export const allergens: Record<string, string[]>[] = [
    {
        'Молочные продукты': [
            'Коровье молоко',
            'Сыр',
            'Йогурт',
            'Сливочное масло',
            'Творог',
            'Сливки',
            'Кефир',
            'Бешамель',
        ],
    },
    {
        Яйцо: [
            'Куриное яйцо',
            'Перепелиное яйцо',
            'Яичный белок',
            'Яичный желток',
            'Сухой яичный порошок',
        ],
    },
    { Рыба: ['Лосось', 'Форель', 'Тунец', 'Сельдь', 'Скумбрия', 'Треска', 'Камбала'] },
    {
        Моллюски: [
            'Креветки',
            'Кальмары',
            'Мидии',
            'Устрицы',
            'Осьминоги',
            'Гребешки',
            'Каракатица',
        ],
    },
    { Орехи: ['Арахис', 'Миндаль', 'Грецкий орех', 'Кешью', 'Фундук', 'Фисташки', 'Пекан'] },
    {
        'Томат (помидор)': [
            'Свежий томат',
            'Томатная паста',
            'Томатный соус',
            'Кетчуп',
            'Сушеные томаты',
            'Томатный сок',
        ],
    },
    { Цитрусовые: ['Апельсин', 'Лимон', 'Грейпфрут', 'Мандарин', 'Лайм', 'Помело', 'Клементин'] },
    {
        'Клубника (ягоды)': [
            'Садовая клубника',
            'Лесная земляника',
            'Малина',
            'Ежевика',
            'Смородина',
            'Крыжовник',
            'Черника',
        ],
    },
    {
        Шоколад: [
            'Какао-бобы',
            'Тёмный шоколад',
            'Молочный шоколад',
            'Шоколадная глазурь',
            'Какао-порошок',
            'Белый шоколад',
            'Шоколадные чипсы',
        ],
    },
];
